app/Models/Peserta_qris.php

    public function getData_peserta(){
        $builder = $this->db->table('peserta_qris');
        $builder->join('profil_peserta', 'profil_peserta.nik = peserta_qris.nik');
        // $builder->orderBy('peserta_qris.id', 'ASC');
        return $builder->limit(100)->get()->getResultArray();
---
SELECT *
FROM `peserta_qris`
JOIN `profil_peserta` ON `profil_peserta`.`nik` = `peserta_qris`.`nik`
 LIMIT 100

    public function sumData_verified(){
        $builder = $this->db->table('peserta_qris');
        $builder->where('verified', 1);
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peserta_qris`
WHERE `verified` = 1