app/Models/Peserta_event.php

    public function sumData_laki(){
        $builder = $this->db->table('peserta_event');
        $builder->where('jenis_kelamin', 1);
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peserta_event`
WHERE `jenis_kelamin` = 1

    public function sumData_perempuan(){
        $builder = $this->db->table('peserta_event');
        $builder->where('jenis_kelamin', 2);
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peserta_event`
WHERE `jenis_kelamin` = 2