app/Models/Ref_event.php

SELECT *
FROM `ref_event`
 LIMIT 100
---
    public function getData_event(){
        $builder = $this->db->table('ref_event');
        return $builder->limit(100)->get()->getResultArray();