app/Models/Transaksi_qris.php

SELECT *
FROM `transaksi_qris`
JOIN `peserta_qris` ON `peserta_qris`.`nik` = `transaksi_qris`.`nik`
WHERE MONTH(transaksi_qris.tanggal_transaksi) = '01'
AND YEAR(transaksi_qris.tanggal_transaksi) = '2023'
 LIMIT 100
---
    public function getData_januari(){
        $builder = $this->db->table('transaksi_qris');
        $builder->join('peserta_qris', 'peserta_qris.nik = transaksi_qris.nik');
        $builder->where('MONTH(transaksi_qris.tanggal_transaksi)', "01");
        $builder->where('YEAR(transaksi_qris.tanggal_transaksi)', "2023");
        return $builder->limit(100)->get()->getResultArray();

SELECT *
FROM `transaksi_qris`
JOIN `peserta_qris` ON `peserta_qris`.`nik` = `transaksi_qris`.`nik`
WHERE MONTH(transaksi_qris.tanggal_transaksi) = '08'
AND YEAR(transaksi_qris.tanggal_transaksi) = '2023'
 LIMIT 100
---
    public function getData_agustus(){
        $builder = $this->db->table('transaksi_qris');
        $builder->join('peserta_qris', 'peserta_qris.nik = transaksi_qris.nik');
        $builder->where('MONTH(transaksi_qris.tanggal_transaksi)', "08");
        $builder->where('YEAR(transaksi_qris.tanggal_transaksi)', "2023");
        return $builder->limit(100)->get()->getResultArray();

SELECT *
FROM `transaksi_qris`
JOIN `peserta_qris` ON `peserta_qris`.`nik` = `transaksi_qris`.`nik`
WHERE MONTH(transaksi_qris.tanggal_transaksi) = '09'
AND YEAR(transaksi_qris.tanggal_transaksi) = '2023'
 LIMIT 100
---
    public function getData_september(){
        $builder = $this->db->table('transaksi_qris');
        $builder->join('peserta_qris', 'peserta_qris.nik = transaksi_qris.nik');
        $builder->where('MONTH(transaksi_qris.tanggal_transaksi)', "09");
        $builder->where('YEAR(transaksi_qris.tanggal_transaksi)', "2023");
        return $builder->limit(100)->get()->getResultArray();

SELECT *
FROM `transaksi_qris`
JOIN `peserta_qris` ON `peserta_qris`.`nik` = `transaksi_qris`.`nik`
WHERE MONTH(transaksi_qris.tanggal_transaksi) = '10'
AND YEAR(transaksi_qris.tanggal_transaksi) = '2023'
 LIMIT 100
---
    public function getData_oktober(){
        $builder = $this->db->table('transaksi_qris');
        $builder->join('peserta_qris', 'peserta_qris.nik = transaksi_qris.nik');
        $builder->where('MONTH(transaksi_qris.tanggal_transaksi)', "10");
        $builder->where('YEAR(transaksi_qris.tanggal_transaksi)', "2023");
        return $builder->limit(100)->get()->getResultArray();

SELECT *
FROM `transaksi_qris`
JOIN `peserta_qris` ON `peserta_qris`.`nik` = `transaksi_qris`.`nik`
WHERE MONTH(transaksi_qris.tanggal_transaksi) = '11'
AND YEAR(transaksi_qris.tanggal_transaksi) = '2023'
 LIMIT 100
---
    public function getData_november(){
        $builder = $this->db->table('transaksi_qris');
        $builder->join('peserta_qris', 'peserta_qris.nik = transaksi_qris.nik');
        $builder->where('MONTH(transaksi_qris.tanggal_transaksi)', "11");
        $builder->where('YEAR(transaksi_qris.tanggal_transaksi)', "2023");
        return $builder->limit(100)->get()->getResultArray();

SELECT *
FROM `transaksi_qris`
JOIN `peserta_qris` ON `peserta_qris`.`nik` = `transaksi_qris`.`nik`
WHERE MONTH(transaksi_qris.tanggal_transaksi) = '12'
AND YEAR(transaksi_qris.tanggal_transaksi) = '2023'
 LIMIT 100
---
    public function getData_desember(){
        $builder = $this->db->table('transaksi_qris');
        $builder->join('peserta_qris', 'peserta_qris.nik = transaksi_qris.nik');
        $builder->where('MONTH(transaksi_qris.tanggal_transaksi)', "12");
        $builder->where('YEAR(transaksi_qris.tanggal_transaksi)', "2023");
        return $builder->limit(100)->get()->getResultArray();